roll2D/0.org/F0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      F0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
20000
(
0.900700928725
0.898222444085
0.901049391562
0.90142286732
0.901712832869
0.89919504339
0.898468816016
0.899995806305
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    y1
    {
        type            cyclic;
    }
    y2
    {
        type            cyclic;
    }
    z1
    {
        type            empty;
    }
    z2
    {
        type            empty;
    }
}


// ************************************************************************* //
